# Цикл for
# Необходим для выполнения повторяющихся действий
for i in range(10, 50, 4):
    print(i, end=' ')

# a - начало, b - конец
# Вывести все чётные числа