# 3. Условные конструкции
'''
if <условие>:
[elif <условие>:]
[else:]
'''

'''
Операции сравнения

> < >= <= == !=

'''

'''
Логические операции

and or not

and операция И, истина, когда все выражения истины

or операция ИЛИ, истина, когда хотя юы одно выражение истино

not операция НЕ, обратное значение

'''

# Определить чётное число или нет

num = int(input())

if num % 2 == 0:
    print("Чётное")
else:
    print("Нечётное")


